#+INCLUDE: /home/ttt/.templates/NoteConfig.org
#+TITLE: Class
#+Author:
#+Email:
#+DATE:  2018-11-22
#+BEGIN_CENTER
*C++ Primer*
#+END_CENTER
**** 隐式的类类型转换
除了c++语言的内置类型之间有自动转换规则以外，我们也可以为类定义隐式转换规则。*如果构造函数只接受一个实参，那我们就可以用
这种实参来转换为类类型，这种构造函数称为转换构造函数*,这种转换只允许一步类类型转换。

隐式的类类型转换是否有用完全看情况，如果在某些情况下我们不希望这种转换的话，我们可以使用 =explicit= 关键字阻止隐式转换，
具体做法是在构造函数的声明中使用该关键字，在类外部定义时不应重复写。 =explicit= 构造函数只能用于直接初始化，而不能用于拷
贝形式的初始化（使用＝）。

虽然编译器不会将 =explicit= 构造函数用于隐式类型转换过程，但是我们可以使用这样的构造函数显式的强制进行转换。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  #include <string>

  class SalesData{
  public:
      // 非委托构造函数使用对应的实参初始化成员
      SalesData(std::string s,unsigned cnt):              // #1
          m_bookNo(s),m_units_sold(cnt){}
      // 其余的构造函数全部委托给另一个构造函数
      SalesData():SalesData("",0){}                       // #2
      explicit SalesData(std::string s):SalesData(s,0){}  // #3
      SalesData(unsigned u):SalesData("",u){}             // #4

      std::string getBookNo() const{return m_bookNo;}
      unsigned getUnitsSold() const{return m_units_sold;}

  private:
      std::string m_bookNo;
      unsigned m_units_sold;
  };

  void printValue(const SalesData& item){
      std::cout<<"m_bookNo: "     <<item.getBookNo() <<"\n"
               <<"m_units_sold: "<<item.getUnitsSold() <<"\n";
  }

  int main(int argc, char *argv[])
  {
      std::cout << "Implicit convertion using #4:\n";
      printValue(2);
      std::cout << "#3 don't allow implicit convertion:\n";
      printValue(SalesData(std::string("Test")));
      printValue(static_cast<SalesData>(std::string("explicit conversion using static_cast")));

      SalesData sd(2); // or SalesData sd = 2; is aloowed.
      SalesData sd1(std::string("TEST"));  //SalesData sd = std::string("TEST"); is not allowed!

      return 0;
  }
#+END_SRC

#+RESULTS:
: Implicit convertion using #4:
: m_bookNo:
: m_units_sold: 2
: #3 don't allow implicit convertion:
: m_bookNo: Test
: m_units_sold: 0
: m_bookNo: explicit conversion using static_cast
: m_units_sold: 0

那么C++在数据封装后布局成本会增加么？答案是不会，因为在每一个class object 中都只
包含non-static data member,就像C struct 一样，而member function 虽然含在class 声
明之内，却不出现在object 之中，每一个non-inline member function 只会产生一个函数
实体，至于每一个”拥有零个或一个定义”的inline function 则会在每一个使用者(模块，
翻译单元)中产生一个函数实体。C++在布局及存取时间上主要的额外负担主要是由 virtual
引起的，包括：
- virtual function 机制 用来支持一个有效率的执行期绑定
- virtual base class 用来实现“多次出现在继承体系中的bass class 有一个单一而被共
  享的实体”
* Data Member
虽然我们大概知道了一个类对象所占用的内存怎么计算了，但是一个空类的对象占用内存是否为0?答案是否定的，一个空类的对象大小为
1,比如：
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  class X{};
  int main(int argc, char *argv[])
  {
      std::cout << sizeof(X) << "\n";
      return 0;
  }

#+END_SRC

#+RESULTS:
: 1
这是因为编译器在 =X= 中安插了一个 ~char~,使得这个类的两个对象可以在内存中配置无二的地址，如果 =X= 中有数据，那么编译器就
不会安插这个 ~char~ 了。
